In [6]:
import pandas as pd
import numpy as np

In [19]:
Student = {
    'Name' : ['Ankit', 'Aishwarya', None, 'Shivangi', 'shwarya'],
    'Age' : [23, 21, None, 21, None],
    'University' : ['BHU', 'JNU', None, 'BHU',None],
}

In [20]:
df=pd.DataFrame(Student)
df

        Name   Age University
0      Ankit  23.0        BHU
1  Aishwarya  21.0        JNU
2       None   NaN       None
3   Shivangi  21.0        BHU
4    shwarya   NaN       None

In [21]:
#Remove missing values with dropna() fuction
df.dropna()

        Name   Age University
0      Ankit  23.0        BHU
1  Aishwarya  21.0        JNU
3   Shivangi  21.0        BHU

In [22]:
df.dropna(axis='index', how='any') 
#this is the default syntax
#index : means to Drop rows which contain missing values
#any: If any NA values are present, drop that row or columns

        Name   Age University
0      Ankit  23.0        BHU
1  Aishwarya  21.0        JNU
3   Shivangi  21.0        BHU

In [23]:
df.dropna(axis='index', how='all') 
#all: If all values are NA, drop that row  or columns

        Name   Age University
0      Ankit  23.0        BHU
1  Aishwarya  21.0        JNU
3   Shivangi  21.0        BHU
4    shwarya   NaN       None

In [24]:
df.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [25]:
#Return a boolean, if the values are NA. NA values, such as None or numpy.NaN, gets mapped to True values
#Everything else gets mapped to False values
df.isna()

    Name    Age  University
0  False  False       False
1  False  False       False
2   True   True        True
3  False  False       False
4  False   True        True

In [26]:
#fillna() manages and let the user replace NaN values with some value of their own
df.fillna('MissedValue')

          Name          Age   University
0        Ankit         23.0          BHU
1    Aishwarya         21.0          JNU
2  MissedValue  MissedValue  MissedValue
3     Shivangi         21.0          BHU
4      shwarya  MissedValue  MissedValue

In [28]:
#returns a Series with the data type of each column
df.dtypes

Name           object
Age           float64
University     object
dtype: object

In [33]:
#in case we want to change the type of data, we use the function dtypes
df['Age']=df['Age'].astype(object)

In [34]:
df.dtypes

Name          object
Age           object
University    object
dtype: object

In [35]:
df['Age']=df['Age'].astype(float)

In [36]:
df.dtypes

Name           object
Age           float64
University     object
dtype: object

In [38]:
#unique function return the unique value for each column
df['Name'].unique()

array(['Ankit', 'Aishwarya', None, 'Shivangi', 'shwarya'], dtype=object)